# Brewfile - Install development tools and applications
# Run: brew bundle install

# CLI Tools - Essential
brew "zsh"
brew "starship"
brew "antigen"
brew "fzf"
brew "git"
brew "vim"
brew "tree"
brew "wget"
brew "curl"
brew "jq"
brew "yq"

# Development Languages & Version Managers
brew "nvm"
brew "pyenv"
brew "rbenv"
brew "go"
brew "rust"

# Cloud & DevOps Tools
brew "kubectl"
brew "helm"
brew "terraform"
brew "awscli"
brew "docker"
brew "docker-compose"

# Build Tools & Package Managers
brew "make"
brew "cmake"
brew "yarn"

# System Tools & Utilities
brew "htop"
brew "btop"
brew "grep"
brew "ripgrep"
brew "fd"
brew "bat"
brew "lazygit"
brew "gh"
brew "gpg"

# GUI Applications
cask "cursor"
cask "visual-studio-code"
cask "warp"
cask "iterm2"
cask "postman"
cask "spotify"

# Fonts (Nerd Fonts are now available directly)
cask "font-fira-code-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Development Tools
cask "sublime-text"
cask "figma"
cask "tableplus"
